In [1]:
import pandas as pd

In [48]:
bios = pd.read_csv('./file_data/bios.csv')

In [3]:
bios['born_city'].value_counts()

born_city
Budapest           1378
Moskva (Moscow)     883
Oslo                708
Stockholm           629
Praha (Prague)      600
                   ...
Bodrogkisfalud        1
Ternberg              1
Klaus                 1
Plaški                1
Dulwich Hill          1
Name: count, Length: 22368, dtype: int64

In [4]:
bios.head()

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
0,1,Jean-François Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,10/2/1960
1,2,Arnaud Boetsch,4/1/1969,Meulan,Yvelines,FRA,France,183.0,76.0,NaN
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrénées-Atlantiques,FRA,France,183.0,76.0,7/17/1994
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,3/20/1978
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,7/25/1930

In [5]:
bios[bios['born_country']=='USA']['born_region'].value_counts().tail()

born_region
South Dakota     27
West Virginia    24
Delaware         22
North Dakota     16
Wyoming          14
Name: count, dtype: int64

In [20]:
marks = pd.read_csv('./UpdatedFile.csv')
marks

  Student Name  Subject  Marks
0        Hasan     Data     42
1         Qaim     Urdu     50
2        Qamer  Biology     54
3      Ibrahim     Data     55
4          Ali  Biology     23
5        Ahmad     Data      1
6       Ghyass     Math     44
7       Tabish     Urdu     22

In [26]:
marks.groupby(['Subject'])['Marks'].mean()
marks.groupby(['Subject'])['Marks'].sum()

Subject
Biology    77
Data       98
Math       44
Urdu       72
Name: Marks, dtype: int64

In [24]:
marks.groupby(['Subject','Student Name']).agg({'Marks':'sum'})

                      Marks
Subject Student Name
Biology Ali              23
        Qamer            54
Data    Ahmad             1
        Hasan            42
        Ibrahim          55
Math    Ghyass           44
Urdu    Qaim             50
        Tabish           22

In [33]:
pivot = marks.pivot(columns='Subject',index='Student Name',values='Marks')
pivot

Subject       Biology  Data  Math  Urdu
Student Name
Ahmad             NaN   1.0   NaN   NaN
Ali              23.0   NaN   NaN   NaN
Ghyass            NaN   NaN  44.0   NaN
Hasan             NaN  42.0   NaN   NaN
Ibrahim           NaN  55.0   NaN   NaN
Qaim              NaN   NaN   NaN  50.0
Qamer            54.0   NaN   NaN   NaN
Tabish            NaN   NaN   NaN  22.0

In [35]:
pivot.loc['Ali']

Subject
Biology    23.0
Data        NaN
Math        NaN
Urdu        NaN
Name: Ali, dtype: float64

In [36]:
pivot.sum()

Subject
Biology    77.0
Data       98.0
Math       44.0
Urdu       72.0
dtype: float64

In [52]:
bios['Born_Details'] = pd.to_datetime(bios['born_date'],errors='coerce')

In [53]:
bios['Born_Year'] = bios['Born_Details'].dt.year

In [59]:
bios.groupby(bios['Born_Details'].dt.year)['name'].count()

Born_Details
1828.0      1
1831.0      2
1833.0      1
1836.0      1
1837.0      1
         ...
1895.0    331
1896.0    370
1897.0    371
1898.0    428
1899.0    449
Name: name, Length: 67, dtype: int64